<h2>Список основных функций программы Holyrics</h2>

<h3>Проекция</h3>
Программа Holyrics — это программное обеспечение, позволяющее отображать и управлять презентациями на дополнительных мониторах системы, подключенных непосредствеенно к видеокарте ПК, а также на других устройствах в локальной сети для получения дополнительной информации.<br>
Поддерживаются:
<ul>
    <li>Песни</li>
    <li>Библейские стихи</li>
    <li>Произвольные тексты</li>
    <li>Изображения, аудио и видео</li>
    <li>Обратный отсчет</li>
    <li>Предупреждения бегущей строкой (внизу или вверху проекционного экрана)</li>
    <li>Текст на мониторе сцены</li>
    <li>Обратный отсчет или таймер на мониторе сцены</li>
    <li>Оповещения на мониторе сцены</li>
</ul>

<hr />

### Готово ###

<h3>Независимость между контентом и макетом</h3>
Holyrics работает независимо между набранным текстом, который будет отображаться на экране, и форматированием, макетом и фоном, которые будут использоваться для отображения этого контента на экране.<br>
При вводе текста песни, текста для отображения или выборе куплета для отображения на экране всегда будет создана связанная тема, созданная пользователем, с информацией о названии шрифта, размере шрифта, цвете, фоне, выравнивании и т. д. для отображения этого контента.<br>
Другими словами, нет необходимости применять форматирование по слайдам, как это необходимо в программах типа PowerPoint.<br>
Просто выберите текст для отображения, и он будет отображаться с форматированием, макетом и фоном в соответствии с заданной темой.<br>

<hr />

<h3>Текст</h3>
<ul>
    <li>Добавить тексты песен в офлайн-репертуар программы.</li>
    <li>Поиск по названию песни или части текста.</li>
    <li>Объедините гимны в группы.</li>
    <li>Определите описание слайдов с песнями (куплет, припев, бридж и т. д.) (<a href='/tips/slide_label.html' target='_blank'>Подробнее</a>)</li>
    <li>Сохранять историю отображения текстов песен в проекции при отображении для отчетов.</li>
    <li>Сохранить тему по умолчанию для текстов песен (главное окно или окно редактирования текста)</li>
    <li>Применить определенные темы или фон к каждому слайду песни (окно редактирования текста)</li>
    <li>Определите порядок слайдов без необходимости повторять один и тот же текст в тексте песни (главное окно, изменить порядок)</li>
    <li>Добавить комментарии к текстам песен, которые будут отображаться только на экране возврата.</li>
    <li>Отображать информацию об авторских правах на проекционном экране.</li>
    <li>Кнопка «Корректор» — корректирует форматирование текста в соответствии со стандартом, используемым в церквях<br>
    Удаляет запятые, точки, пробелы в начале и конце каждой строки, корректирует неправильную пунктуацию и т. д.
    </li>
    <li>Импортировать тексты песен из других источников</li>
    <li>Проверка орфографии (доступна для некоторых языков)</li>
    <li>Слайд-шоу на нескольких языках (<a href='/tips/multiple_languages.html' target='_blank'>Подробнее</a>)</li>
    <li>Дополнительная информация о песне: тональность, BPM, темп, ссылки на потоковые платформы и т. д.</li>
</ul>

<hr />

<h3>Святая Библия</h3>
<ul>
    <li>Отображение библейских стихов</li>
    <li>Доступно несколько переводов благодаря партнерству с библейскими издателями, а также общедоступным переводам.</li>
    <li>Быстро выберите и отобразите стих, просто набрав ссылку на клавиатуре.</li>
    <li>Поиск стиха по отрывку (CTRL+F)</li>
    <li>Отображать определенную последовательность стихов.</li>
    <li>Запустить автоматическое представление списка стихов.</li>
    <li>Отображать несколько стихов одновременно</li>
    <li>Возможность разделить длинные стихи для отображения на нескольких слайдах.</li>
    <li>Отображать только ссылку на стих без текста.</li>
    <li>Создавайте ярлыки для конкретного перевода Библии, например, связывая имя человека с переводом.</li>
    <li>Кнопка для сравнения версий и отображения текущего стиха в различных доступных переводах Библии.</li>
    <li>Отображение до трех разных версий Библии одновременно.</li>
    <li>Выбор разных версий для разных экранов.</li>
    <li>Сопоставление стихов при отображении переводов с разных языков<br>
    Например, при отображении Псалма 23 на английском языке будет отображаться Псалом 22 на русском языке.
    </li>
    <li>Альтернативное чтение — возможность начать презентацию стихов с описанием «церковь/лидер» для альтернативного чтения.</li>
    <li>Выберите расположение ссылки на стих и соответствующее форматирование.</li>
    <li>Выделите отрывок стиха «выделителем» (щелкните стих правой кнопкой мыши)<br>
    Позволяет игнорировать часть стиха, например, применяя курсив и подчеркивание к определенной части стиха.
    </li>
    <li>Отображение версии Библии в проекции в сокращенном, полном или с учетом авторских прав различно для каждой версии Библии.<br>
    В некоторых версиях может потребоваться отображение полного названия перевода или информации об авторских правах, при этом в проекции не допускается отображать только аббревиатуру версии.<br>
    Это зависит не от программы Holyrics, а от каждого издателя, ответственного за соответствующую версию Библии.
    </li>
</ul>

<hr />

<h3>Текст</h3>
<ul>
<li>Добавляйте различные тексты в офлайн-репертуар программы.</li>
<li>Поиск по названию или отрывку текста</li>
<li>Разбивайте тексты по подпапкам.</li>
<li>Сохранить тему по умолчанию для текстового представления (главное окно или окно редактирования текста)</li>
<li>Применить определенные темы или фон к каждому слайду текстовой презентации (окну редактирования текста)</li>
<li>Добавить комментарии к тексту презентации, которые будут отображаться только на экране возврата.</li>
<li>Автоматически разбивать длинные тексты на разные слайды (щелкните правой кнопкой мыши текстовое поле в окне редактирования)</li>
<li>
Кнопка «Корректор» — корректирует форматирование текста в соответствии со стандартом, используемым в церквях<br>
Удаляет запятые, точки, пробелы в начале и конце каждой строки, корректирует неправильную пунктуацию и т. д.
</li>
<li>Проверка орфографии (доступна для некоторых языков)</li>
<li>Слайд-шоу на нескольких языках (<a href='/tips/multiple_languages.html' target='_blank'>Подробнее</a>)</li>
</ul>

<hr />

<h3>Тема</h3>
Для отображения контента в проекции программа использует темы для применения форматирования отображения.<br>
Можно создать несколько тем для использования в различных функциях программы и легко переключаться между созданными темами одним щелчком мыши.<br>
Доступные настройки темы:<br>
<ul>
<li>Фон: сплошной цвет, изображение, видео, прозрачный.</li>
<li>Шрифт, размер, цвет, контур, яркость, тень, жирный шрифт, курсив.</li>
<li>Поля, вертикальное и горизонтальное выравнивание, расстояние между строками и символами.</li>
<li>Цвет фона и контур: примените цвет фона к каждой строке.</li>
<li>
Текстуры — можно использовать текстуры в качестве «цвета» шрифта и цвета фона (<a href='/tips/color_texture.html' target='_blank'>Подробнее</a>)<br>
• Сплошной цвет: используйте стандартный сплошной цвет<br>
• Градиент: используйте комбинацию двух или более цветов, образуя горизонтальный или вертикальный градиент<br>
• Изображение: используйте изображение в качестве текстуры для рендеринга<br>
• Прозрачный: прозрачное отображение шрифта в сочетании с цветом фона, создавая эффект пустоты и показывая фон позади текста.
</li>
<li>Комментарий: настройки форматирования комментариев.</li>
<li>Различные настройки: отображение текста заглавными буквами, установка автоматического переноса строк.</li>
<li>Упорядочивайте темы по тегам, например: синий, вода, круг и т. д.</li>
</ul>
<b>Примечание.</b> По умолчанию видео, используемые в качестве фона, воспроизводятся только на общедоступном экране из соображений производительности.<br>
На других экранах системы вместо фонового видео будет использоваться статическое изображение.<br>
В меню «Файл», настройках, вкладке «Дополнительно» можно установить дополнительный экран для отображения видео в качестве фона.

<hr />

<h3>Изображения, аудио, видео и файлы</h3>
Программа Holyrics интегрирована с программой VLC Player для воспроизведения аудио и видео.<br>

<ul>
<li>Библиотека аудио, видео и изображений в главном окне программы для организации файлов.</li>
<li>Поиск файлов в папке (и подпапках, в зависимости от конфигурации)</li>
<li>
Когда вы создаете подпапку, она становится списком воспроизведения для отображения медиафайлов в этой подпапке.<br>
Другими словами, чтобы отобразить последовательность изображений, создайте подпапку и добавьте все изображения в соответствующую подпапку.<br>
</li>
<li>Автоматическое отображение изображений (правая кнопка мыши на подпапке)</li>
<li>Поддерживает перетаскивание файлов.</li>
<li>Добавьте ярлыки для отображения файлов из других папок на вашем компьютере.</li>
<li>Установить размер для отображения видео и изображений: заполнить, подогнать...</li>
<li>Создать видео из последовательности изображений (щелкните правой кнопкой мыши подпапку с изображениями)</li>
<li>Применить к изображению эффекты (яркость, контрастность, оттенок и т. д.)</li>
<li>Отображение изображения с эффектом размытия, когда изображение выходит за пределы проекционного экрана.</li>
<li>Отображение разных изображений (например, разного разрешения) на разных экранах (<a href='/tips/image_multiple_screens.html' target='_blank'>Подробнее</a>)</li>
<li>
Редактирование медиа (щелкните правой кнопкой мыши по медиа - редактировать)<br>
Аудио – вырезанный отрывок<br>
Видео - вырезать раздел/изменить разрешение и битрейт/извлечь аудио<br>
Изображение – обрезка/изменение размера
</li>
<li>
Возможность переименовать файл (правая кнопка мыши) непосредственно из программы вместо переименования из проводника операционной системы<br>
Это позволяет обновлять ссылки на файлы, используемые в функциях программы (например, панель закладок), при переименовании файла.<br>
При переименовании через файловый менеджер теряются ссылки на ресурсы программы, пытаются получить доступ и выполнить файл с прежним именем.
</li>
<li>
На вкладке «Файлы» вы можете добавлять и упорядочивать файлы любого типа, но файлы, как правило, будут открываться самой операционной системой.<br>
Программа Holyrics может запускать файлы .ppt .pptx из этой папки, но она доступна только для Windows, и для этого необходимо установить программу PowerPoint.
</li>
</ul>

<h3>Проигрыватель VLC</h3>
<ul>
<li>Отображение одного файла или списка файлов</li>
<li>Повторное воспроизведение одного файла или списка воспроизведения</li>
<li>Вариант «Случайный»</li>
<li>Отображение видео на нескольких экранах</li>
<li>Запустить веб-камеру</li>
<li>Расширенные настройки: поля, постепенное появление/уменьшение и т. д.</li>
<li>Нажатие на «таймер» плеера переключает значение между отображением прошедшего и оставшегося времени.</li>
</ul>

<hr />
<h3>Служения и мероприятия</h3>
<ul>
<li>Регистрация регулярных служений и событий в системе.</li>
<li>Зарегистрируйте конкретное событие, указав его дату и время.</li>
<li>
Зарегистрированные сервисы автоматически создают плейлисты для каждого сервиса.<br>
Например, для службы, зарегистрированной как «каждое воскресенье в 19:00», плейлист будет автоматически создаваться каждое воскресенье в 19:00.<br>
Позволяет вам регистрировать музыку и медиафайлы, используемые в каждом богослужении и мероприятии независимо.
</li>
<li>
Настройте <a href='#wallpaper'>обои</a> для служения (файл меню, настройки, обои)<br>
Установите <a href='#wallpaper'>обои</a> для мероприятия (во всплывающем окне редактирования мероприятия)<br>
Таким образом, <a href='#wallpaper'>обои</a>, используемые в проекции, автоматически будут изображением, определенным для соответствующего служения или события из списка воспроизведения, выбранного в главном окне программы.<br>
Избегайте необходимости менять обои для каждой услуги или события.
</li>
<li>
При регистрации услуги с правилом «все» есть возможность скрыть отдельные недели<br>
Например, вы хотите зарегистрировать Святое Причастие «каждое второе воскресенье»<br>
Если у вас есть услуга, зарегистрированная как «каждое воскресенье», может быть создан дубликат плейлиста<br>
Таким образом, скрывая вторую неделю службы «каждое воскресенье», можно избежать дублирования списка, создавая только плейлист службы «Святая Вечеря» для второго воскресенья каждого месяца.
</li>
</ul>

<hr />
<h3>Плейлист</h3>
Все услуги, регулярные события и уникальные события, зарегистрированные в системе, формируют независимый плейлист, что позволяет заранее организовать плейлист для каждой услуги и события, а также вести историю всех ранее созданных программ.
<ul>
<li>
Плейлист с текстами песен<br>
Добавьте все тексты песен, которые будут использоваться в соответствующем сервисе или мероприятии.<br>
Можно выбрать несколько элементов для последовательного выполнения<br>
Опция в настройках для автоматического сохранения истории просмотра (отметить как прослушанную) при просмотре текстов песен и их включения в список воспроизведения.
</li>
<li>
Медиа-плейлист (также поддерживает тексты песен)<br>
Медиа в данном случае — это общий термин, он не означает просто аудио, видео и изображение<br>
Медиа-плейлист – это место для добавления и систематизации всех элементов, которые будут воспроизводиться на соответствующей службе или мероприятии.<br>
Тексты песен, библейские стихи, текст, аудио, видео, изображения, объявления, автоматическое представление, обратный отсчет и т. д.<br>
Вы можете организовать список с помощью заголовков, которые могут скрывать или расширять подэлементы, добавленные под соответствующим заголовком (<a href='/tips/playlist_title.html' target='_blank'>Подробнее</a>).<br>
Установите продолжительность для каждого элемента списка<br>
Отобразить вероятное время выполнения элемента (время расписания) от начала услуги/события и продолжительность каждого предыдущего элемента в списке (временная шкала).
</li>
<li>Поделитесь в Интернете списком текстов песен, к которому можно получить доступ через браузер, а также загрузить на другой компьютер.</li>
<li>Сохранение плейлиста в файл для открытия на другом компьютере.</li>
<li>Сохранять шаблоны списков мультимедиа для повторного использования в других сервисах и мероприятиях.</li>
</ul>

<hr />
<h3>Масштаб</h3>
Наряду с регистрацией служб и мероприятий в программе Holyrics можно регистрировать команды, роли и участников, что позволяет создавать расписания служб и событий.<br>
Основное внимание в программе уделяется не администрированию и организации команд, программа предоставляет только базовые функции администрирования и создания расписания.

<hr />
<h3>Мобильное приложение</h3>
Вы можете управлять программой Holyrics через мобильное приложение Holyrics.<br>
<ul>
<li>
Основные функции доступны для управления в приложении.<br>
Тексты песен, стихи из Библии, медиа, медиаплеер и т. д.
</li>
<li>
Обновите данные приложения с помощью данных компьютера<br>
Вы можете скачать список песен, плейлист, историю и т. д. в мобильное приложение для просмотра контента в любое время, а не только при подключении к программе.<br>
Члены служения прославления могут получить доступ к музыкальному репертуару на своем мобильном телефоне, что упрощает поиск и создание плейлиста для предстоящих служений.
</li>
<li>
Отправляйте файлы с телефона на компьютер (версия 2024-04 доступна только для Android)<br>
</li>
</ul>

<hr />
<h3>Настройки отображения</h3>
Независимые настройки для каждого экрана системы
<ul>
<li>Изменить поля экрана (размер)</li>
<li>Отображение дополнительной информации, такой как счетчик слайдов, описание слайда, название песни, авторские права и т. д.</li>
<li>Установить экран в качестве сцены</li>
<li>
Измените версию Библии, отображаемую на соответствующем экране<br>
Можно настроить определенный экран так, чтобы всегда отображалась версия 2 окна Библии, что позволяет отображать разные версии на разных экранах.
</li>
<li>Изменить <a href='multiple_language'>перевод</a>, отображаемый на соответствующем экране</li>
</ul>

<hr />
<h3>Вид на сцену</h3>
Возможность использовать дополнительные мониторы в операционной системе (или браузере через http) для отображения эксклюзивного контента с форматированием, отличным от контента, отображаемого на главном экране.
<ul>
<li>Изменить тему/форматирование/макет, используемые для отображения контента на экране возврата.</li>
<li>Отображение содержимого слайдов следующей песни на экране возврата.</li>
<li>Применить различное форматирование к текущему содержимому и содержимому предстоящих слайдов.</li>
<li>Отображение комментариев к отображаемому контенту</li>
<li>Отображение содержимого <a href='#communication_panel'>панели связи</a></li>
<li>Показывать следующее изображение при отображении списка изображений</li>
<li>Выберите тип контента, отображаемого для вывода через http.</li>
</ul>

<hr />
<h3>Макет программы – главное окно</h3>
<ul>
<li>
<b>Левая часть:</b> данные библиотеки/пользователя<br>
Текст песни, текст, аудио, видео, изображение, файл и т. д.<br>
<i>Окно отображения оповещений слева внизу</i>
</li>
<li>
<b>Центральная левая часть:</b> список абзацев/слайдов текста песни или выделенного текста.
</li>
<li>
<b>Центральная правая часть:</b> VLC Player и предварительный просмотр абзаца/слайда, выбранного в списке, а также слайдов, отображаемых на экране проецирования или возврата.
</li>
<li>
<b>Правая часть:</b> Список воспроизведения событий и список тем<br>
Список тем может отображаться вертикально или горизонтально (под списком воспроизведения).
</li>
<li><b>Внизу (во время презентации):</b> <a href='#presentation_footer'>Нижний колонтитул презентации</a></li>
<li><b>Встроенный чат:</b> отображать внутренний чат Holyrics где-нибудь в главном окне (меню Windows, встроенный чат)</li>
<li>Макет программы в светлом или темном режиме (меню Windows)</li>
</ul>

<hr />
<h3 id='presentation_footer'>Нижний колонтитул презентации</h3>
<ul>
<li>В нижнем колонтитуле презентации может отображаться только текст слайдов или слайд в формате изображения (предварительный просмотр)</li>
<li>В нижнем колонтитуле можно отображать до 4 строк контента для одновременного просмотра нескольких слайдов.</li>
<li>Кнопка +/- для изменения шрифта или размера изображения слайда нижнего колонтитула презентации.</li>
<li>Просмотр описания слайда (припев, куплет и т. д.) и индекса каждого слайда.</li>
<li>
Функционал «Перейти». Текстовое поле в левом углу нижнего колонтитула презентации.<br>
Позволяет ввести число и перейти к определенному введенному слайду или сочетание клавиш, например букву <b>C</b>, для перехода к слайду <b>Припев</b><br>.
Сочетание клавиш можно настроить в <b>Настройки экрана, общедоступная вкладка, описание слайда</b>.
</li>
<li>
Меняйте тему или фон презентации в реальном времени.<br>
В левом нижнем углу нижнего колонтитула презентации находится кнопка темы.<br>
Отображает список тем и фонов, доступных для изменения презентации в режиме реального времени.<br>
Это можно изменить двойным щелчком мыши (изменяются все слайды в презентации) или перетаскиванием темы/фона на определенный слайд в нижнем колонтитуле презентации.
</li>
<li>Редактировать текст на слайде в режиме реального времени (щелкните слайд правой кнопкой мыши)</li>
<li>При удержании клавиши CTRL и стрелок влево/вправо слайд в проекции меняется, только при отпускании клавиши CTRL.</li>
</ul>

<hr />
<h3 id='communication_panel'>Панель связи</h3>
Панель отображения эксклюзивного контента для экрана возврата (вид на сцену)
<ul>
<li>Отображать текст во весь экран</li>
<li>Отображать оповещение в нижней или верхней части экрана.</li>
<li>Отображение текущего времени на весь экран или в оповещении.</li>
<li>Отображение обратного отсчета или таймера.</li>
<li>Настройка сохранения текста на экране возврата при удалении текста из презентации в проекции (F8, F9, F10...)</li>
<li>Кнопка «привлечь внимание», мигающая изображением внимания на экране (несовместимо для вывода через http)</li>
<li>Сохранять сообщения, готовые к отображению.</li>
<li>Возможность отображать текст всегда впереди всего или только тогда, когда на дисплее нет презентации.</li>
<li>Возможность отображать обратный отсчет в полноэкранном режиме, когда презентация не запущена, и автоматически отображать ее в оповещении во время презентации.</li>
<li>
Чат для внутреннего общения, возможность общаться с другими участниками через мобильное приложение Holyrics.<br>
Внутренний чат Holyrics можно синхронизировать с группой Telegram <a href='#telegram_features'>(Подробнее)</a>
</li>
<li>Вкладка «Настройки» для форматирования определенного контента, например определения различных цветов обратного отсчета, когда он близок к завершению, когда он отрицательный и т. д.</li>
<li>Отображение оставшегося времени работы мультимедиа в программном проигрывателе.</li>
</ul>

<hr />
<h3 id='plugin_holyrics'>Плагин Holyrics</h3>
Промежуточный коммуникационный интерфейс, который позволяет HTTP-серверу получать доступ к контенту, отображаемому в проекции, через HTTP.<br>
Для просмотра в браузерах или добавления в качестве источника в эфирные программы.

<hr />
<h3>Множественный выбор (викторина)</h3>
(меню инструментов)<br />
Функциональность для создания презентаций вопросов и ответов с множественным выбором.<br />
<ul>
<li>Создавайте вопросы и ответы с несколькими вариантами ответов.</li>
<li>Отображать вопросы последовательно или в случайном порядке.</li>
<li>Показать обратный отсчет до ответа.</li>
<li>Параметры, позволяющие скрыть альтернативы.</li>
<li>Различные настройки рендеринга (шрифт, цвет, фон и т. д.)</li>
<li>
Настройте аудио для воспроизведения на каждом этапе презентации.<br />
В начале презентации (вопрос и варианты), во время обратного отсчета правильных и неправильных ответов.<br />
Для шага «начало презентации» можно настроить разные звуки.<br />
Например, начиная с четвертого вопроса воспроизводится другой звук, начиная с восьмого вопроса — другой звук и т. д.
</li>
<li>Возможность управления <a href='#scoreboard'>табло</a> с результатами каждой команды</li>
</ul>

<hr />
<h3 id='scoreboard'>Таблица</h3>
(меню инструментов, разное)<br />
Создавайте группы (команды) и управляйте счетом каждой группы для отображения на экране.

<hr />
<h3>Лотерея</h3>
(меню инструментов)<br />
Создайте розыгрыш из последовательности чисел или списка имен/предметов.<br />
<ul>
<li>Различные настройки рендеринга (скорость, длительность, шрифт, цвет, фон и т. д.)</li>
<li>Установить воспроизведение звука во время рисования и при отображении нарисованного элемента</li>
<li>Нарисовать несколько элементов одновременно</li>
</ul>

<hr />
<h3 id='telegram_features'>Функции, интегрированные с Telegram</h3>
<ul>
<li>
<b>Вопросы:</b> Создайте сеанс вопросов, где люди смогут отправлять вопросы боту Telegram, и эти вопросы будут доступны в окне Holyrics, что позволит вам легко управлять ими и отображать их в проекции (меню инструментов, несколько)
</li>
<li>
<b>Опрос:</b> Создайте опрос, в котором люди смогут голосовать за чат-бота, и результат будет отображаться на проекции (меню инструментов, разное).
</li>
<li>
<b>Лотерея:</b> Создайте розыгрыш, где люди могут зарегистрироваться для участия в розыгрыше в чат-боте, и список участников будет автоматически доступен в окне розыгрыша программы (меню инструментов).
</li>
<li>
<b>Чат:</b> синхронизируйте группу Telegram с внутренним чатом Holyrics, чтобы сообщения, полученные в группе Telegram, можно было просматривать в собственном окне чата Holyrics, а сообщения, отправленные пользователями, в собственном чате Holyrics (через компьютер или мобильное приложение) также можно посмотреть в группе Telegram (меню Windows, чат)
</li>
<li>
<b>Файл:</b> Все файлы, отправленные персонализированному чат-боту, зарегистрированному в учетной записи пользователя Holyrics, будут перечислены и организованы в окне программы (меню инструментов, разное)<br>
Упрощение отправки файлов в программу: каждый может отправить файл чат-боту и получить к нему доступ непосредственно из интерфейса Holyrics<br>
Ограничение в 20 МБ для отправки файла непосредственно в чат, но для файлов большего размера можно отправить ссылку на Google Диск в чат.
</li>
</ul>

<hr />
<h3>Панель закладок</h3>
Панель избранного, расположенная в верхней части главного окна или окна Библии, позволяет добавлять различные типы исполняемых элементов программы, такие как видео, изображения, рекламные объявления и т. д.<br>
Место для добавления часто используемых элементов для быстрого доступа.<br>
Вы можете распределять элементы по папкам и подпапкам<br>

<hr />
<h3>Имитация проекции</h3>
Возможность программы для имитации дополнительных экранов, подключенных к системе.<br>
Полезно в ситуациях, когда у вас нет подключенного второго экрана и вы хотите работать с программой так, как если бы у вас был подключен второй экран.<br>
Или добавьте еще один экран возврата, чтобы использовать экран, имитирующий существование экрана возврата.<br>
Полезно для изучения и изучения возможностей программы.

<hr />
<h3>Облачная синхронизация — GoogleDrive™</h3>
Программа позволяет синхронизировать облачные данные между разными компьютерами, синхронизируя все данные программы и медиафайлы (кроме локальных настроек).<br>
Таким образом, вы можете создавать новые тексты песен, презентации, добавлять медиафайлы, создавать списки воспроизведения и т. д. на своем домашнем компьютере и подготовьте все на церковном компьютере.<br>
И, конечно же, наоборот: все, что делается на церковном компьютере, будет доступно на вашем домашнем компьютере.<br>

<hr />
<h3>Резервное копирование в облаке – GoogleDrive™</h3>
Программа позволяет выполнять резервное копирование данных в облаке.<br>
Таким образом, данные и настройки программы сохраняются на Диске, что позволяет при необходимости восстановить данные<br>
В отличие от облачной синхронизации, резервное копирование позволяет подключить только один компьютер для каждого пользователя Google<br>

<hr />
<h3>Масштаб</h3>
Наряду с регистрацией служб и мероприятий в программе Holyrics можно регистрировать команды, роли и участников, что позволяет создавать расписания служб и событий.<br>
Основное внимание в программе уделяется не администрированию и организации команд, программа предоставляет только базовые функции администрирования и создания расписания.<br>
<b>Создание списков на основе участников:</b> сетка, в которой каждый столбец представляет собой служение или событие, каждая строка — это член, а каждая ячейка — поле, позволяющее определить, запланирован ли участник на участие в соответствующем служении/мероприятии. <br>
В этом типе расписания невозможно определить, какую роль будет выполнять участник.<br>
<b>Создавайте списки на основе ролей:</b> сетка, в которой каждый столбец — это служение или событие, каждая строка — это роль, а каждая ячейка — список участников, которым можно назначить ту или иную роль.<br>

<hr />
<h3>Реклама</h3>
Создание объявлений с использованием фонового изображения и ввод текста для отображения<br>
Позволяет управлять рекламой, которая должна отображаться во время услуг и мероприятий<br>
Запуск автоматического показа нескольких рекламных объявлений, меняющихся на экране каждые X секунд<br>

<hr />
<h3>Автоматическая презентация</h3>
(меню инструментов)<br />
Можно создать автоматическую презентацию текста песни, запрограммировав длительность каждого слайда, интегрированную со звуком в формате MP3 (например, воспроизведение).<br>
При запуске автоматической презентации слайды с текстами песен будут воспроизводиться вместе со звуком.<br>

<hr />
<h3>Персонализированное сообщение</h3>
Функциональность для создания предварительно отформатированных сообщений для более практичного и организованного отображения многоразового текста.<br>
Например: <i>{имя</i>, пожалуйста, зайдите в <i>{location}</i><br>
Где <i>{имя</i> и <i>{местоположение</i> — это поля, которые будут заполнены пользователем без необходимости записывать весь контент.<br>
Сообщение может отображаться на общем экране или на экране возврата (вид на сцену).<br>
И его можно отображать в полноэкранном режиме или в виде оповещения<br>

<hr />
<h3>Отчеты</h3>
В программе можно создавать отчеты об использовании<br>
<ul>
<li>
<b>Проигранные песни:</b> отчет со списком текстов песен, наиболее часто отображаемых в проекции<br>
Пользователь должен добавить теги «воспроизводимой песни» при отображении музыки в проекции или включить автоматическую пометку в настройках списка воспроизведения.
</li>
<li>
<b>Масштаб:</b> список, в котором указано, сколько раз масштабировался каждый участник или песня.
</li>
<li>
<b>Отчет о деятельности:</b> отчет со всеми презентациями, сделанными в программе (тексты песен, куплеты, медиа и т. д.)<br>
Необходимо активировать отчет о деятельности, чтобы программа сохраняла активность.
</li>
</ul>

<hr />
<h3>Оповещение</h3>
(левый нижний угол главного окна)<br />
Отобразите предупреждающее сообщение в нижнем колонтитуле или вверху экрана, не нарушая и не удаляя текущую презентацию.<br>
Настройте относительную высоту оповещения на экране, цвет, шрифт и т. д.<br>
В длинных сообщениях текст будет «бегать» поперек<br>

<hr />
<h3>Обратный отсчет</h3>
(меню инструментов)<br />
Запустите обратный отсчет на проекции, обычно чтобы указать время, оставшееся до начала услуги или мероприятия<br>
Определите текст, который будет отображаться рядом с обратным отсчетом<br>
Установите действие по умолчанию, которое будет автоматически выполняться по окончании обратного отсчета<br>

<hr />
<h3 id='wallpaper'>Обои</h3>
(меню файлов, настройки, обои)<br>
Установите обои, которые будут отображаться по умолчанию на проекционном экране, когда презентация не отображается<br>
Установите разные изображения обоев для разных услуг и событий<br>
Отображать часы рядом с обоями<br>

<hr />
<h3>Логотип</h3>
(меню инструментов)<br>
Настройте анимированное изображение или GIF-изображение, чтобы оно всегда отображалось в углу проекционного экрана, даже во время презентации<br>
Настройки так, чтобы изображение, определенное как логотип, располагалось по центру экрана при отсутствии презентации и отображалось в углу при ее наличии<br>

<hr />
<h3>Эффект перехода</h3>
(настройки дисплея)<br>
Различные параметры и настройки эффектов перехода между текстом и изображениями.<br>
<b>Примечание:</b><br />
 - По умолчанию эффекты перехода выполняются только на общедоступном экране из соображений производительности.<br>
В меню файлов, настройках, вкладке «Дополнительно» можно определить дополнительный экран для выполнения эффектов перехода.<br />
 - При запуске или завершении презентации эффект постепенного появления/затухания окна презентации настраивается в меню «Файл», настройках, вкладке «Общие».<br>

<hr />
<h3>Запланированные задачи</h3>
(меню инструментов)<br />
Запланируйте запуск элемента в определенные дни недели и время<br>
Товар будет выполнен в указанный день и время<br>
Для некоторых запланированных элементов, например видео, можно определить дополнительные настройки, указав громкость, которая будет установлена ​​в плеере при воспроизведении видео<br>
За 1 минуту до времени выполнения элемента в углу экрана отображается уведомление о том, что элемент скоро будет выполнен, с кнопкой отмены действия при необходимости<br>
Примечание. Это внутренняя функция программы, она работает только в том случае, если программа открыта<br>
Вы также можете запланировать запуск задачи один раз в определенное время, щелкнув элемент правой кнопкой мыши.<br>
Например, щелкнув правой кнопкой мыши изображение и запланировав запуск задачи в определенное время.<br />

<hr />
<h3>Расширенный редактор</h3>
(окно редактирования, 3 точки)<br />
Расширенное окно редактирования текстов песен и текстового представления<br>
Позволяет вносить расширенные изменения в слайд, применяя определенное форматирование к словам или отрывкам на слайде<br>
Шрифт, размер, жирный шрифт, курсив, подчеркивание и т. д.<br>
Вы можете сохранить стиль форматирования <code>(style)</code>, чтобы быстро применить его к выбранному разделу.<br />
Например, создайте <code>(style)</code>, который применяет форматирование желтым цветом, подчеркиванием и курсивом.<br />
Щелкните раздел правой кнопкой мыши, выберите сохраненное форматирование, которое хотите применить, в подменю «стиль» или создайте новое форматирование<br />

<hr />
<h3>MIDI</h3>
(меню инструментов)<br />
MIDI — это протокол связи между электронными музыкальными инструментами и другими электронными устройствами (например, компьютером или другим инструментом)<br>
Функциональность MIDI в программе позволяет выполнять действия в программе с использованием этого протокола<br>
Например, вы можете автоматически управлять слайд-шоу в зависимости от темпа музыки<br>
(<a href='/tips/midi.html' target='_blank'>Подробнее</a>)<br>

<hr />
<h3>JavaScript (ECMA 5.1)</h3>
Некоторые функции программы позволяют использовать JavaScript для реализации более сложных и точных решений.<br>
Это позволяет программе выполнять задачи, выходящие за рамки изначально настроенных, в зависимости только от индивидуальной реализации пользователя с использованием кодов, написанных на JavaScript<br>
<a href='/go.php?action=jslib_doc' target='_blank'>Документация</a><br>
Некоторые ресурсы, использующие JavaScript<br>
<ul>
<li>
<b>Включить:</b> область, позволяющая пользователю создать собственную библиотеку кода с многоразовыми методами в любом ресурсе, использующем JavaScript в программе<br>
</li>
<li>
<b>Запуск:</b> выполнение кода JavaScript при запуске программы<br>
</li>
<li>
<b>Системные переменные.</b> Создайте методы JavaScript, возвращающие определенное значение, которое можно использовать в тексте презентации или оповещения.<br>
Например, создайте метод под названием "abc" <code>function abc() {...</code> и в тексте, отображаемом в проекции, используйте <code>Test @js{abc} test</code>< бр>
код <code>@js{abc}</code> будет заменен в реальном времени в проекции содержимым, возвращаемым в <code>функции abc() {...</code><br>
(<a href='/tips/system_var_js.html' target='_blank'>Подробнее</a>)
</li>
<li>
<b>JSCommunity:</b> В программе доступен репозиторий многократно используемых кодов (<a href='/go.php?action=community_doc' target='_blank'>Подробнее</a>)
</li>
<li>
<b>Скрипт:</b> создайте элемент «Скрипт», выполняющий код JavaScript (<a href='/tips/holyrics_script.html' target='_blank'>Подробнее</a>)
</li>
<li>
<b>API-сервер</b>. Создавайте собственные действия (маршруты) для ресурса <a href='#api_server'>API-сервер</a>, что позволяет при необходимости возвращать определенные ответы в дополнение к стандартным действиям. доступен в официальной документации.
</li>
<li>
<b>Триггеры.</b> Выполнение кода JavaScript как действие <a href='#trigger'>триггера</a>.
</li>
<li>
<b>Контекстное действие:</b> • Создание сценариев, которые (щелкнув правой кнопкой мыши по элементу программы) будут получать соответствующий элемент в качестве параметра для выполнения специального действия;</a>
</li>
</ul>
Как правило, исполняемые элементы программы (тексты, медиа и т. д.) отображают параметр <b>Информация о сценарии</b> при нажатии правой кнопки мыши.<br />
Эта опция отображает информацию об элементе, такую ​​как идентификатор элемента и готовый к выполнению пример кода JavaScript для элемента.<br />

<hr />
<h3>API</h3>
(меню инструментов, разное)<br>
Вы можете создавать элементы для добавления на панель избранного или в список воспроизведения, которые выполняют HTTP-запросы, отправляют MIDI-коды на другие устройства или выполняют код JavaScript.<br>
Это позволяет вам выполнять действия в других программах и устройствах, таких как OBS Studio, программа освещения, PTZ-камеры и т. д., или выполнять сценарии, которые взаимодействуют с программой, имея возможность выполнять действия или список действий в программном и точном виде. путь.<br>
Например, вы можете создать элемент, который при выполнении меняет сцену в вашей программе трансляции, или элемент, который выбирает предустановку с PTZ-камеры в сети и т. д.<br>
(<a href='/tips/api_item.html' target='_blank'>Подробнее</a>)<br>

<hr />
<h3 id='trigger'>Триггеры</h3>
(меню инструментов, разное)<br>
Выполнять действия автоматически, когда что-то происходит в программе.<br>
Например, исполнение чего-либо всякий раз, когда на проекции отображаются тексты песен.<br>
Он позволяет автоматизировать повторяющиеся задачи и интегрировать различные мультимедийные сектора и инструменты.<br>
Например, автоматическая смена сцен в эфирной программе, изменение освещения и т. д.<br>

<hr />
<h3 id='api_server'>API-сервер</h3>
(меню «Файл», настройки, API-сервер)<br>
Коммуникационный API для выполнения действий и доступа к данным из программы Holyrics по протоколу HTTP.<br>
(<a href='/go.php?action=api_server_doc' target='_blank'>Документация</a>)<br>

<hr />
<h3>Горячие клавиши</h3>
(меню помощи)<br>
Редактируемые сочетания клавиш для функций программы.<br>

<hr />
<h3>Быстрая презентация стихов</h3>
При отображении текстового элемента или файла .pptx, если в тексте слайда есть библейская ссылка, стих можно отобразить быстро, не завершая текущую презентацию.<br>
(<a href='/tips/quick_verse_presentation.html' target='_blank'>Подробнее</a>)<br>

<hr />
<h3>Фильтр тем по умолчанию</h3>
(тематическое меню)<br />
Тему можно легко повторно использовать в любой программной среде, но во многих ситуациях тема, созданная пользователем, имеет определенное применение в функциональности программы.<br>
Для облегчения организации можно определить фильтр по умолчанию, чтобы в списке тем различных функций программы отображались только те элементы, которые вы определяете для этих функций.<br>
(<a href='/tips/default_themes_filter.html' target='_blank'>Подробнее</a>)<br>

<hr />
<h3>Системные переменные</h3>
(меню инструментов, разное)<br>
Используйте коды в тексте, отображаемом в проекции, где код будет заменен на определенное значение в реальном времени.<br>
Например, используя код @hour_minute, в проекции этот код будет преобразован в текущие час и минуту системы.

<hr />
<h3>Синхронизация BPM</h3>
Во многих случаях фоновые видео, используемые при проецировании, слишком быстры для более медленной музыки, а другие видео слишком медленны для более быстрой музыки.<br>
В программе можно включить автоматическую синхронизацию, чтобы скорость воспроизведения фонового видео при отображении текста песни соответствовала скорости самой песни.<br>
(<a href='/tips/bpm_sync.html' target='_blank'>Подробнее</a>)<br>

<hr />
<h3>Среда выполнения</h3>
Опция «Среда выполнения» служит для облегчения управления некоторыми другими функциями программы при активации опции «облачной синхронизации» на нескольких компьютерах.
(<a href='/tips/runtime_environment.html' target='_blank'>Подробнее</a>)<br>

<hr />
<h3>Отображение веб-сайта/страницы в полноэкранном режиме</h3>
Чтобы открыть веб-сайт/страницу в полноэкранном режиме на проекционном экране<br />
(<a href='/tips/fullscreen_website.html' target='_blank'>Подробнее</a>)<br>

<hr />
<h3>Мобильность</h3>
Программа портативна, ее можно переносить на другой жесткий диск и даже на внешние устройства.<br>
(<a href='/faq#q039' target='_blank'>Подробнее</a>)<br>

<hr />
<h3>[Описание слайда] Группировать похожие описания</h3>
В некоторых случаях слайды с текстами песен могут иметь разные описания, но означать одно и то же.<br>
Например: хор и хор<br>
Чтобы гарантировать, что описание припева всегда идентифицируется программой как описание припева:<br>
- Доступ к настройкам описания слайдов (настройки отображения);<br>
- Нажмите на 3 точки в описании хора;<br>
– Выберите псевдонимы > добавьте и добавьте название припева.<br>

<hr />
<h3>Тема/фон (автоматизация)</h3>
(тематическое меню, автоматизация)<br />
Создавайте правила для динамического задания темы или фона слайдов презентации.<br />
Позволяет определить тему/фон в зависимости от текстового содержимого слайда, динамически создавая презентации.<br />
Например, если в тексте слайда есть слово «огонь», установите нужную тему/фон.<br />

<hr />
<h3>Оттенок — Фон</h3>
(меню Windows, строка меню, оттенок) <br />
Изменение оттенка фонового видео <br />
Например, видео с преобладанием зеленого цвета может отображаться как преимущественно синее непосредственно в проекции в динамическом режиме.<br />
Это облегчает повторное использование видео в разных цветах, а также обеспечивает лучшую интеграцию с окружающим освещением.<br />

<hr />
<h3>Заказать музыкальные слайды как сборник гимнов</h3>
Возможность автоматического добавления слайда припева/хора между каждым куплетом песни в презентации.<br />
Создать или отредактировать группу песен (меню редактирования, группу);<br />
Щелкните правой кнопкой мыши по нужной группе и активируйте настройку;<br />
Все песни в этой группе будут отображаться с добавлением припева или слайда припева поочередно с другими слайдами (куплетами) песни.<br />
Примечание. В тексте песни должно быть как минимум описание слайда «припев» или «припев», добавленное на правильный слайд, чтобы определить, какой слайд будет добавлен среди других слайдов (куплетов)<br />

<hr />
<h3>Настройки воспроизведения аудио/видео</h3>
Возможность настроить параметры воспроизведения аудио или видео в избранном или списке воспроизведения (щелкните правой кнопкой мыши по элементу).<br />
Например, установка определенной громкости, определенной минуты/секунды для запуска видео (и/или остановки) и т. д.<br />
